Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
r apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id-analyses_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jf0ae5"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_integration" "biosamples-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "9yc7o0"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "9yc7o0"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-runs will be created
  + resource "aws_api_gateway_integration" "biosamples-id-runs" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "52agiu"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id-runs_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "52agiu"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "c9sp8j"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples_post will be created
  + resource "aws_api_gateway_integration" "biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "dwz69z"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.configuration will be created
  + resource "aws_api_gateway_integration" "configuration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "9ask40"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets will be created
  + resource "aws_api_gateway_integration" "datasets" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ntfu57"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms will be created
  + resource "aws_api_gateway_integration" "datasets-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "c7dqqp"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "datasets-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "c7dqqp"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id will be created
  + resource "aws_api_gateway_integration" "datasets-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "vms1x9"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples will be created
  + resource "aws_api_gateway_integration" "datasets-id-biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "08r17w"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "08r17w"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_integration" "datasets-id-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "o31pln"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "o31pln"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants will be created
  + resource "aws_api_gateway_integration" "datasets-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "17gn4d"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "17gn4d"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-individuals will be created
  + resource "aws_api_gateway_integration" "datasets-id-individuals" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "55f0ph"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-individuals_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "55f0ph"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id_post will be created
  + resource "aws_api_gateway_integration" "datasets-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "vms1x9"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets_post will be created
  + resource "aws_api_gateway_integration" "datasets_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ntfu57"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.dportal_proxy will be created
  + resource "aws_api_gateway_integration" "dportal_proxy" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "mjdn4a"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.entry_types will be created
  + resource "aws_api_gateway_integration" "entry_types" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "me1gr2"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.filtering_terms will be created
  + resource "aws_api_gateway_integration" "filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "rfizu7"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants will be created
  + resource "aws_api_gateway_integration" "g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "oksazd"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id will be created
  + resource "aws_api_gateway_integration" "g_variants-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "88k2n2"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_integration" "g_variants-id-biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "gvydrq"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_integration" "g_variants-id-biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "gvydrq"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals will be created
  + resource "aws_api_gateway_integration" "g_variants-id-individuals" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "bcpcgb"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_integration" "g_variants-id-individuals_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "bcpcgb"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id_post will be created
  + resource "aws_api_gateway_integration" "g_variants-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "88k2n2"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants_post will be created
  + resource "aws_api_gateway_integration" "g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "oksazd"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals will be created
  + resource "aws_api_gateway_integration" "individuals" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "d4v2mw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms will be created
  + resource "aws_api_gateway_integration" "individuals-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "rpa5ip"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "individuals-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "rpa5ip"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id will be created
  + resource "aws_api_gateway_integration" "individuals-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "17pgiw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples will be created
  + resource "aws_api_gateway_integration" "individuals-id-biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "yu9rfv"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_integration" "individuals-id-biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "yu9rfv"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants will be created
  + resource "aws_api_gateway_integration" "individuals-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "o2x49v"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "individuals-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "o2x49v"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id_post will be created
  + resource "aws_api_gateway_integration" "individuals-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "17pgiw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals_post will be created
  + resource "aws_api_gateway_integration" "individuals_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "d4v2mw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.info will be created
  + resource "aws_api_gateway_integration" "info" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "w1uo1z"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.map will be created
  + resource "aws_api_gateway_integration" "map" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "v8f8or"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.projects will be created
  + resource "aws_api_gateway_integration" "projects" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.root-get will be created
  + resource "aws_api_gateway_integration" "root-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "z2ld8cvjie"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs will be created
  + resource "aws_api_gateway_integration" "runs" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "o9o632"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-filtering_terms will be created
  + resource "aws_api_gateway_integration" "runs-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "u59tai"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "runs-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "u59tai"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id will be created
  + resource "aws_api_gateway_integration" "runs-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "kn7dr3"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-analyses will be created
  + resource "aws_api_gateway_integration" "runs-id-analyses" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "j1b1px"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post will be created
  + resource "aws_api_gateway_integration" "runs-id-analyses_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "j1b1px"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-g_variants will be created
  + resource "aws_api_gateway_integration" "runs-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "17x1r3"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "runs-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "17x1r3"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id_post will be created
  + resource "aws_api_gateway_integration" "runs-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "kn7dr3"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs_post will be created
  + resource "aws_api_gateway_integration" "runs_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "o9o632"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration_response.admin_proxy will be created
  + resource "aws_api_gateway_integration_response" "admin_proxy" {
      + http_method        = "ANY"
      + id                 = (known after apply)
      + resource_id        = "qx53wo"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses will be created
  + resource "aws_api_gateway_integration_response" "analyses" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "f0uknw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "analyses-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "llpnux"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "analyses-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "llpnux"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id will be created
  + resource "aws_api_gateway_integration_response" "analyses-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "29kks9"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "analyses-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "g9qlhw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "analyses-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "g9qlhw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id_post will be created
  + resource "aws_api_gateway_integration_response" "analyses-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "29kks9"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses_post will be created
  + resource "aws_api_gateway_integration_response" "analyses_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "f0uknw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples will be created
  + resource "aws_api_gateway_integration_response" "biosamples" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "dwz69z"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "biosamples-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "yksgg6"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "yksgg6"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "c9sp8j"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-analyses" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "jf0ae5"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-analyses_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "jf0ae5"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "9yc7o0"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "9yc7o0"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-runs" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "52agiu"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-runs_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "52agiu"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "c9sp8j"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "dwz69z"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.configuration will be created
  + resource "aws_api_gateway_integration_response" "configuration" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "9ask40"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets will be created
  + resource "aws_api_gateway_integration_response" "datasets" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "ntfu57"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "datasets-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "c7dqqp"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "c7dqqp"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id will be created
  + resource "aws_api_gateway_integration_response" "datasets-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "vms1x9"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-biosamples" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "08r17w"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-biosamples_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "08r17w"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "o31pln"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "o31pln"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "17gn4d"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "17gn4d"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-individuals" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "55f0ph"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-individuals_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "55f0ph"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "vms1x9"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets_post will be created
  + resource "aws_api_gateway_integration_response" "datasets_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "ntfu57"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.dportal_proxy will be created
  + resource "aws_api_gateway_integration_response" "dportal_proxy" {
      + http_method        = "ANY"
      + id                 = (known after apply)
      + resource_id        = "mjdn4a"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.entry_types will be created
  + resource "aws_api_gateway_integration_response" "entry_types" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "me1gr2"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "rfizu7"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants will be created
  + resource "aws_api_gateway_integration_response" "g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "oksazd"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id will be created
  + resource "aws_api_gateway_integration_response" "g_variants-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "88k2n2"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_integration_response" "g_variants-id-biosamples" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "gvydrq"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_integration_response" "g_variants-id-biosamples_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "gvydrq"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals will be created
  + resource "aws_api_gateway_integration_response" "g_variants-id-individuals" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "bcpcgb"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_integration_response" "g_variants-id-individuals_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "bcpcgb"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post will be created
  + resource "aws_api_gateway_integration_response" "g_variants-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "88k2n2"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "oksazd"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals will be created
  + resource "aws_api_gateway_integration_response" "individuals" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "d4v2mw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "individuals-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "rpa5ip"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "individuals-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "rpa5ip"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id will be created
  + resource "aws_api_gateway_integration_response" "individuals-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "17pgiw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples will be created
  + resource "aws_api_gateway_integration_response" "individuals-id-biosamples" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "yu9rfv"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_integration_response" "individuals-id-biosamples_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "yu9rfv"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "individuals-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "o2x49v"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "individuals-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "o2x49v"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id_post will be created
  + resource "aws_api_gateway_integration_response" "individuals-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "17pgiw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals_post will be created
  + resource "aws_api_gateway_integration_response" "individuals_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "d4v2mw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.info will be created
  + resource "aws_api_gateway_integration_response" "info" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "w1uo1z"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "mrduzjc80i"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.map will be created
  + resource "aws_api_gateway_integration_response" "map" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "v8f8or"
      + response_templates = {

```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.